# Core Brew Repositories
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'buo/cask-upgrade'

# Command-Line Mac App Store
# NB: Sign in the macOS App Store beforehand
brew 'mas'
mas 'CopyClip', id: 595191960
mas 'Slack', id: 803453959
mas 'OneDrive', id: 823766827
mas 'Kindle', id: 405399194
mas 'Xcode', id: 497799835
mas 'GarageBand', id: 682658836

# Cask macOS apps
cask 'authy'
cask 'disk-drill'
cask 'google-chrome'
cask 'discord'
cask 'iterm2'
cask 'steam'
cask 'typora'
cask 'visual-studio-code'
cask 'zoom'

# Cask macOS utils
cask 'appcleaner'
cask 'the-unarchiver'
cask 'geekbench'

# Cask fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# Dev/Core
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'htop'
brew 'hub' # CLI GitHub support
brew 'git'
brew 'gradle'
brew 'tree'
brew 'wget'
brew 'zsh'
cask 'google-drive'
cask 'google-drive-file-stream'

# Dev/Cloud
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'

# Dev/Python
brew 'python'
brew 'pyenv'

# Dev/Ruby
#   https://github.com/rbenv/rbenv#command-reference
#   > rbenv init
#   > rbenv install <version>
#   > echo '<version>' > .ruby-version
#   > gem install bundler
brew 'ruby'
brew 'rbenv'

# Dev/Misc
brew 'antibody' # Shell plugin manager
brew 'diff-so-fancy'
brew 'fzf'
brew 'jupyterlab'
brew 'peco' # Interactive CLI Filtering Tool
brew 'pygments'
brew 'terminal-notifier'
brew 'xz' # Data compressor
cask 'typora' # Markdown Reader/Writer

# Fun
brew 'speedtest-cli'
brew 'youtube-dl'
