# Oh-My-Zsh
ohmyzsh/ohmyzsh path:plugins/bgnotify
ohmyzsh/ohmyzsh path:plugins/git

# Command Line
djui/alias-tips
junegunn/fzf

# Java
caarlos0-graveyard/jvm

# ZSH
caarlos0-graveyard/zsh-mkc
marlonrichert/zsh-autocomplete
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting