# Core Brew Repositories
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'buo/cask-upgrade'

# Dev/Core
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'htop'
brew 'hub' # CLI GitHub support
brew 'git'
brew 'gradle'
brew 'tree'
brew 'wget'
brew 'zsh'

# Dev/Cloud
brew 'awscli'
brew 'azure-cli'

# Dev/Python
brew 'python'
brew 'pyenv'

# Dev/Ruby
#   https://github.com/rbenv/rbenv#command-reference
#   > rbenv init
#   > rbenv install <version>
#   > echo '<version>' > .ruby-version
#   > gem install bundler
brew 'ruby'
brew 'rbenv'

# Dev/Misc
brew 'antibody' # Shell plugin manager
brew 'diff-so-fancy'
brew 'fzf'
brew 'jupyterlab'
brew 'peco' # Interactive CLI Filtering Tool
brew 'pygments'
brew 'terminal-notifier'
brew 'xz' # Data compressor

# Fun
brew 'speedtest-cli'
brew 'youtube-dl'
